src/CF/Catalogs/РГНастройкиРепозиториев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>РГНастройкиРепозиториев</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКРепозиторию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколСоединения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РГПротоколыСоединения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьЛокальногоХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РГСпособыАвторизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Enums/РГСпособыАвторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>РГСпособыАвторизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПаролю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OAuth</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/Catalogs/РГНастройкиРепозиториев/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
// Возвращает строку соединения для подключения к Git.
//
// Параметры:
//  Настройка   - СправочникСсылка.Git_НастройкиРепозиториев
// 
// Возвращаемое значение:
//  Строка
Функция ПолучитьСтрокуСоединения(Настройка) Экспорт 

	Если Настройка.СпособАвторизации = Перечисления.РГСпособыАвторизации.OAuth Тогда
		ДанныеАвторизации = РГПолныеПрава.ПрочитатьДанныеИзБезопасногоХранилища(Настройка, "Токен");
		Если Не ДанныеАвторизации = Неопределено Тогда
			СтрокаАвторизации = "" + ДанныеАвторизации + "@";		
		КонецЕсли;
	ИначеЕсли Настройка.СпособАвторизации = Перечисления.РГСпособыАвторизации.ПоПаролю Тогда
		ДанныеАвторизации = РГПолныеПрава.ПрочитатьДанныеИзБезопасногоХранилища(Настройка, 
																						"Логин, Пароль"); 
		Если Не ДанныеАвторизации = Неопределено Тогда
			СтрокаАвторизации = "" + ДанныеАвторизации.Логин + ":" + ДанныеАвторизации.Пароль + "@";
		Иначе
			СтрокаАвторизации = "";
		КонецЕсли;
	Иначе
		СтрокаАвторизации = "";
	КонецЕсли; 
	
	Возврат Строка(Настройка.ПротоколСоединения) + СтрокаАвторизации + Настройка.ПутьКРепозиторию;
	
КонецФункции
#КонецОбласти
